{
    "projects":[
        {
            "id": 0,
            "project_name": "Random Quote Generator",
            "description": "The Random Quote Generator represents my first venture into the world of JavaScript. This project supplies the DOM with data from an array of objects which hold some of my favorite quotes and their author, along with any other information like tags or year. Furthermore, quotes are updated every 10 seconds, so you can use it as a screensaver of sorts. Although simple in design, this project is extremely valuable in serving as a springboard to get into the more complex elements of web development.",
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "live_link": "https://holjeffcomb.github.io/TechDegree-Project-1/",
            "github_link": "https://github.com/holjeffcomb/TechDegree-Project-1",
            "image_urls": [
                "\\static\\images\\random-quote-generator-square.jpg",
                "\\static\\images\\random-quote-generator-1.jpg",
                "\\static\\images\\random-quote-generator-2.jpg"
            ]
        },
        {
            "id": 1,
            "project_name": "Data Pagination Site",
            "description": "The purpose of the Data Pagination Site was to get some practice in properly displaying a large amount of data, like an employee directory, in a user-friendly way. In this case, the employee directory is generated from an API of random, non-existant people and stored in a JSON file, then displayed in a paginated format for easy and intuitive browsing. Search bar functionality also narrows the list of employees. All of these features are implemented by accessing and manipulating the DOM.",
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "live_link": "https://holjeffcomb.github.io/Pagination-Project/",
            "github_link": "https://github.com/holjeffcomb/Pagination-Project",
            "image_urls": [
                "\\static\\images\\pagination-square.jpg",
                "\\static\\images\\pagination-1.jpg",
                "\\static\\images\\pagination-2.jpg"
            ]
        },
        {
            "id": 2,
            "project_name": "Dynamic Form Validation",
            "description": "This project uses various techniques and regular expressions in JavaScript to validate entries in a form, giving a smoother overall user experience. Through DOM manipulation and JavaScript logic, the form updates dynamically as the user enters values in the various fields. The email address field will show an error if an invalid email format is entered, or the activity registration section will gray out certain activities if there is a scheduling conflict.",
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "live_link": "https://holjeffcomb.github.io/Dynamic-Form-Project/",
            "github_link": "https://github.com/holjeffcomb/Dynamic-Form-Project",
            "image_urls": [
                "\\static\\images\\validation-form-square.jpg",
                "\\static\\images\\validation-form-1.jpg",
                "\\static\\images\\validation-form-2.jpg"
            ]
        },
        {
            "id": 3,
            "project_name": "Phrase Hunter App",
            "description": "The Phrase Hunter App is my first experience with building a web-based game. The game pulls a phrase from an array of phrase objects, hides it, and the user has to guess the phrase like a game of Hangman, while only being given five incorrect guesses before game over. This project implements JavaScript DOM manipulation to update the board as guesses are made, and uses static image files to display the amount of hearts left.",
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "live_link": "https://holjeffcomb.github.io/oop-game-show-app/",
            "github_link": "https://github.com/holjeffcomb/oop-game-show-app",
            "image_urls": [
                "\\static\\images\\phrase-hunter-square.jpg",
                "\\static\\images\\phrase-hunter-1.jpg",
                "\\static\\images\\phrase-hunter-2.jpg"
            ]
        },
        {
            "id": 4,
            "project_name": "API Request Directory",
            "description": "While similar to the Data Pagination Project, this project takes it a step beyond by integrating an actual API request from an external database. The API provides a list of randomly generated users to populate a directory of employees. A search function helps to narrow down results, and clicking on each user will build a modal window of the selected employee, so the you can get a more in-depth look at their details. CSS values are updated when the user hovers their mouse over certain elements on the page, giving a cleaner and more user-friendly experience.",
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS",
                "API",
                "Modal Windows"
            ],
            "live_link": "https://holjeffcomb.github.io/public-api-project/",
            "github_link": "https://github.com/holjeffcomb/public-api-project",
            "image_urls": [
                "\\static\\images\\api-pull-directory-square.jpg",
                "\\static\\images\\api-pull-directory-1.jpg",
                "\\static\\images\\api-pull-directory-2.jpg"
            ]
        }
    ]
}